Tekla.Structures.Dialog.Data.DialogData
The Tekla.Structures.Dialog.Data.DialogData class is used for initializing Tekla Structures Model objects.

Tekla.Structures.Dialog.Data.DialogData.dictionary
The dictionary for storing dialog data.

Tekla.Structures.Dialog.Data.DialogData.componentName
The name of the current component.

Tekla.Structures.Dialog.Data.DialogData.SetCurrentValues(Tekla.Structures.Model.BaseComponent)
Initializes the Tekla.Structures.Model.Component using the current values.
component: The component instance.
Returns: True if the current values were set correctly.

Tekla.Structures.Dialog.Data.DialogData.ApplyCurrentPositionValues(Tekla.Structures.Model.CustomPart)
Applies the current position values to the given custom part.
customPart: The custom part instance.
Returns: False if it was not possible to try to apply the values.

Tekla.Structures.Dialog.Data.DialogData.GetCurrentValuesFromTs(System.String)
Gets the applied dialog values for the given component from Tekla Structures.
name: The component name.

Tekla.Structures.Dialog.Data.DialogData.SetPositionOption(Tekla.Structures.Model.CustomPart,System.String,System.Int32)
Sets the custom part's position option that matches the attributeName.
customPart: The custom part.
attributeName: The attribute name.
value: The value of the position option.

Tekla.Structures.Dialog.Data.DialogData.SetPositionOffset(Tekla.Structures.Model.CustomPart,System.String,System.Double)
Sets the custom part's position offset that matches the attributeName.
customPart: The custom part.
attributeName: The attribute name.
value: The value of the position offset.